#include <stdio.h>
#include <math.h>

int main (){
  int x, z, n, a = 0;
  float y;
  printf("\n___________________________________________\n");
  printf("Запустити програму - 1\n");
  printf("Вийти з програми - 2\n");
  printf("___________________________________________\n");
  while (1){
    if (a == 0) {
     printf("\nВвести: ");
     scanf("%d", &n);
     a++;
   }
   else {
     printf("\n\n___________________________________________\n");
     printf("Ви можете спробувати ще раз - 1 \nВийти з програми - 2\n");
     printf("___________________________________________\n");
     printf("Ввести: ");
     scanf("%d", &n);
   }
   if (n == 1){
     printf ("Задайте 2 числа\n");
     printf ("Введіть число х: ");
     scanf ("%d", &x);
     printf ("Введіть число z: ");
     scanf ("%d", &z);

     if ((sqrt (x)-2 * sqrt (x*z)) == 0){
       printf("\nДля заданих значень x та z виконується ділення на 0\n");
        printf("Спробуйте ще раз...\n");
     }
     else if ((x<0)||(x * z<0)){
       printf("\nДля заданих значень x та z виконується добування кореня з від'ємного числа\n");
        printf("Спробуйте ще раз...\n");
     }
     else{
       y=(sqrt ((float)x)+2*sqrt((float)x*(float)z))/(sqrt ((float)x)-2 * sqrt ((float)x*(float)z));
       
        printf("\n_____________________\n");
        printf("Відповідь: %.2f", y);

     }

   }
   else{
     break;
   }
  }


}
