#include <stdio.h>
#include <math.h>
int main() {
  int n, a=0;

  printf("\n-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
  printf("Як будемо запускати програму\n");
  printf("З використанням циклу з параметром (цикл for) - 1\n");
  printf("З використанням циклу з передумовою (цикл while) - 2\n");
  printf("З використанням циклу з післяумовою (цикл do while) - 3\n");
  printf("Вийти з програми - 4\n");
  printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");

  while (1) {
    if (a == 0) {
      printf("\nВвести: ");
      scanf("%d", &n);
      a++;
    }

    else {

      printf("\n\n-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
      printf("Ви можете спробувати ще раз...\n");
      printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
      printf("З використанням циклу з параметром (цикл for) - 1\n");
      printf("З використанням циклу з передумовою (цикл while) - 2\n");
      printf("З використанням циклу з післяумовою (цикл do while) - 3\n");
      printf("Вийти з програми - 4\n");
      printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
      printf("Ввести: ");
      scanf("%d", &n);
    }
                                 // З використанням циклу  параметром (цикл for)
    if (n==1) {
      int dobytok = 1;
      for (int i=20; i<=80; i++) {
        if (i % 5 == 0) {
          dobytok *= i;
        }
      }
      printf("\nВідповідь:\n");
      printf("Сума чисел кратних 5 у діапазоні [20, 80]: %d", dobytok);
    }

                                // З використанням циклу з передумовою (цикл while)
    else if (n==2) {
      int dobytok = 1;
      int i = 20;
      while (i <= 80) {
        if (i % 5 == 0) {
          dobytok *= i;
        }
        i++;
      }
      printf("\nВідповідь:\n");
      printf("Сума чисел кратних 5 у діапазоні [20, 80]: %d", dobytok);
    }

                             // З використанням циклу з післяумовою (цикл do while)

    else if (n==3) {
      int dobytok = 1;
      int i = 20;
      do {
        if (i % 5 == 0) {
          dobytok *= i;
        }
        i++;
      } while (i <= 80);
      printf("\nВідповідь:\n");
      printf("Сума чисел кратних 5 у діапазоні [20, 80]: %d", dobytok);
    }
  else{
      break;
    }
  }
  return 0;
}
