#include <stdio.h>
#include <math.h>

int main() {
  int n, u=0;
  float a, b, dx, y;

  printf("\n-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
  printf("Запуск програми - 1\n");
  printf("Вийти з програми - 2\n");
  printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");

  while (1) {
    if (u == 0) {
      printf("\nВвести: ");
      scanf("%d", &n);
      u++;
    }
    else {
      printf("\n\n-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
      printf("Ви можете спробувати ще раз - 1 \n Вийти з програми - 2\n");
      printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\n");
      printf("Ввести: ");
      scanf("%d", &n);
    }

    if (n==1) {

      printf("\nВведіть нижню границю інтервалу: ");
      scanf("%f", &a);
      printf("Введіть верхню границю інтервалу: ");
      scanf("%f", &b);
      printf("Введіть крок інтервалу: ");
      scanf("%f", &dx);


      if (a + dx > b) {
        printf("\nВведені некоректні значення нижньої та верхньої границі\n");
        printf("Спробуйте ще раз...\n");
      }
      else {
        if (a > 0 || b > 0 || dx > 0) {
          printf("\n-_-_-_-_-_-_-_-_-_-_-\n");
          printf("Нижня границя: %.2f\n", a);
          printf("Верхня границя: %.2f\n", b);
          printf("Крок: %.2f\n", dx);
          printf("\n______________________\n");
          printf(" X\t\tY\n");
          printf("______________________\n");

          while (a <= b) {
            y = pow(a, 3);
            printf(" %.2f\t\t%.2f\n", a, y);
            a += dx;
          }
        }
        else {
          printf("\nВведені некоректні дані!\n");
        }
      }
    }

    else{
      break;
    }
  }
  return 0;
}
